from setdatabase import database_setting


def proposalset(cnx, cursor):
    cnx, cursor = database_setting()
    array = [["400001", "장애인활동 지원에 관한 법률 일부개정법률안", "2667"],
             ["400002", "변호사법 일부개정법률안", "2842"],
             ["400003", "사할린한인 국내유족에 대한 지원 특별법안", "2638"],
             ["400004", "소방기본법 일부개정법률안", "2573"],
             ["400005", "보행안전 및 편의증진에 관한 법률 일부개정법률안", "2857"],
             ["400006", "지방세특례제한법 일부개정법률안", "2442"],
             ["400007", "자동차관리법 일부개정법률안 ", "2865"],
             ["400008", "국가인권위원회법 일부개정법률안", "2573"],
             ["400009", "근로기준법 일부개정법률안 ", "2573"],
             ["400010", "가정폭력범죄의 처벌 등에 관한 특례법 일부개정법률안", "2573"]]
    table = "proposal"
    table_column = "(proposalCd, proposalNm, proposerCd) "
    insert_tuple = "INSERT into " + table + table_column + "values "
    insert_query = insert_tuple + "(%s, %s, %s) ON DUPLICATE KEY UPDATE proposalCd = proposalCd;"

    for i, value in enumerate(array):
        cursor.execute(insert_query, (value[0], value[1], value[2]))
        cnx.commit()

    cnx.commit()


def assemblyman_has_proposal(cnx, cursor):
    array = [["400001", "신상진"], ["400001","문진국"], ["400001","박명재"], ["400001","송석준"], ["400001","심재철"], ["400001","원유철"], ["400001","유재중"], ["400001","윤상현"], ["400001","이완영"], ["400001","이주영"],
             ["400002", "권칠승"], ["400002","김병기"], ["400002","김종민"], ["400002","김태년"], ["400002","박광온"], ["400002","박정"], ["400002","손혜원"], ["400002","신창현"], ["400002","윤관석"], ["400002","윤준호"],
             ["400003", "윤상현"], ["400003","김성원"], ["400003","김순례"], ["400003","박덕흠"], ["400003","서청원"], ["400003","성일종"], ["400003","원유철"], ["400003","이완영"], ["400003","이은권"], ["400003","정유섭"],
             ["400004", "윤후덕"], ["400004","금태섭"], ["400004","김철민"], ["400004","남인순"], ["400004","박정"], ["400004","심기준"], ["400004","유동수"], ["400004","이수혁"], ["400004","이찬열"], ["400004","전혜숙"], ["400004","정춘숙"],
             ["400005", "정인화"], ["400005","김영춘"], ["400005","김종민"], ["400005","유성엽"], ["400005","윤영일"], ["400005","이동섭"], ["400005","이상헌"], ["400005","장정숙"], ["400005","정동영"], ["400005","조배숙"], ["400005","천정배"], ["400005","홍문표"],
             ["400006", "윤재옥"], ["400006","김규환"], ["400006","김성찬"], ["400006","김정재"], ["400006","민경욱"], ["400006","박인숙"], ["400006","유민봉"], ["400006","유재중"], ["400006","추경호"], ["400006","홍철호"],
             ["400007", "김영호"], ["400007","기동민"], ["400007","김병기"], ["400007","김성수"], ["400007","김종민"], ["400007","박홍근"], ["400007","신창현"], ["400007","이재정"], ["400007","이찬열"], ["400007","이철희"],
             ["400008", "윤후덕"], ["400008","금태섭"], ["400008","김경협"], ["400008","김철민"], ["400008","박정"], ["400008","유동수"], ["400008","이수혁"], ["400008","이찬열"], ["400008","이철희"], ["400008","임종성"], ["400008","전혜숙"], ["400008","정춘숙"],
             ["400009", "윤후덕"], ["400009","금태섭"], ["400009","김병기"], ["400009","김철민"], ["400009","박정"], ["400009","심기준"], ["400009","이수혁"], ["400009","이찬열"], ["400009","전혜숙"], ["400009","정춘숙"],
             ["400010", "윤후덕"], ["400010","강창일"], ["400010","금태섭"], ["400010","김경협"], ["400010","김철민"], ["400010","맹성규"], ["400010","박정"], ["400010","백혜련"], ["400010","신창현"], ["400010","유동수"], ["400010","이규희"], ["400010","전혜숙"], ["400010","정춘숙"], ["400010","최재성"]]

    table = "assemblyman_has_proposal"
    table_column = "(assemblymanCd, proposalCd) "
    insert_tuple = "INSERT into " + table + table_column + "values "
    insert_query = insert_tuple + "(%s, %s) ON DUPLICATE KEY UPDATE proposalCd = proposalCd, assemblymanCd = assemblymanCd"

    for i, value in enumerate(array):
        data_proposalCd = array[i][0]
        data_assemblymanCd = getCd(array[i][1], cnx, cursor)
        cursor.execute(insert_query, (data_assemblymanCd, data_proposalCd))
        cnx.commit()

    cnx.commit()

def getCd(name, cnx, cursor):
    table = "assemblyman"
    select_query = "select assemblymanCd from assemblyman where assemblyman.empNm = '" + name + "';"
    cursor.execute(select_query)
    Cds = cursor.fetchall()
    return Cds[0][0]

if __name__ == "__main__":
    cnx, cursor = database_setting()
    proposalset(cnx, cursor)
    assemblyman_has_proposal(cnx, cursor)

